#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/joshuayeungzuhlke/openapi-petstore-devops/runs/run-jCWNByQhCQ7XoMVu

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
random_string.suffix: Refreshing state... [id=cSTm2s3X]
data.terraform_remote_state.eks: Read complete after 0s
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=education-eks-cSTm2s3X-cluster-20221101020111561200000001-20221101020112397300000007]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00ed9d3858799ce6f]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-867197491]
aws_security_group.node_group_two: Refreshing state... [id=sg-0e50ead75caa19255]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=education-eks-cSTm2s3X-cluster-20221101020111561200000001-20221101020112396500000006]
aws_security_group.node_group_one: Refreshing state... [id=sg-0708ad38f4d693d96]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06f890f07828d21f0]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::502648746362:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/AAF147321E0BA8177AD1C370F55A3DBA]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-1-eks-node-group-20221101020113350400000009-2022110102011526530000000e]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2325922403]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-056e9cef5f0707096]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b5b4e05f0425b5fe1080289494]
module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-cSTm2s3X:node-group-2-20221101021007837200000016]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-1-eks-node-group-20221101020113350400000009-2022110102011530960000000f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01bad3e8ad4f127d9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a77f6d8f64eebccf]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1353730512]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fe6eb76dbfcf6788]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-230865357]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06dd6077940bd8e21]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0926af082fb2873d1]
module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0]: Refreshing state... [id=education-eks-cSTm2s3X:node-group-1-20221101021007836600000014]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b76c04e2167e6329]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-1043196791]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/education-eks-cSTm2s3X/cluster]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d2ebfda94a0f2cc11080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06bdb13d11914762e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c6772c650ed71e6e]
module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b315abcd941a05e6]
module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-1-eks-node-group-20221101020113350400000009-2022110102011513360000000d]
module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0]: Refreshing state... [id=node-group-1-eks-node-group-20221101020113350400000009]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b5b4e05f0425b5fe]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=node-group-2-eks-node-group-20221101020113350200000008-2022110102011481840000000a]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-1294878526]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0cc61a88089e29664]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-501278056]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-cSTm2s3X]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0464fcd7f70fb881e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0204c92f83adb71a1]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d2ebfda94a0f2cc1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-09f06054afd4a7ddf]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e60bc5b5a31b3181]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3717957931]
module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0]: Refreshing state... [id=node-group-2-eks-node-group-20221101020113350200000008]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f88d0dc8f9d336d5]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-3556363000]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-3966656301]
module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0]: Refreshing state... [id=lt-01bfff9762c543e29]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2957666577]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=node-group-2-eks-node-group-20221101020113350200000008-2022110102011492380000000b]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0f0ea443d8e4e7385]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=education-eks-cSTm2s3X-cluster-20221101020111561200000001]
module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=node-group-2-eks-node-group-20221101020113350200000008-2022110102011502930000000c]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2042899140]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-588939209]
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster.cluster: Read complete after 0s [id=education-eks-cSTm2s3X]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group.node_group_one will be destroyed
  # (because aws_security_group.node_group_one is not in configuration)
  - resource "aws_security_group" "node_group_one" {
      - arn                    = "arn:aws:ec2:us-east-2:502648746362:security-group/sg-0708ad38f4d693d96" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0708ad38f4d693d96" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/8",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "node_group_one20221101020111579800000003" -> null
      - name_prefix            = "node_group_one" -> null
      - owner_id               = "502648746362" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-06dd6077940bd8e21" -> null
    }

  # aws_security_group.node_group_two will be destroyed
  # (because aws_security_group.node_group_two is not in configuration)
  - resource "aws_security_group" "node_group_two" {
      - arn                    = "arn:aws:ec2:us-east-2:502648746362:security-group/sg-0e50ead75caa19255" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0e50ead75caa19255" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/16",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ] -> null
      - name                   = "node_group_two20221101020111580600000004" -> null
      - name_prefix            = "node_group_two" -> null
      - owner_id               = "502648746362" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-06dd6077940bd8e21" -> null
    }

  # kubernetes_deployment.openapi_petstore will be created
  + resource "kubernetes_deployment" "openapi_petstore" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "App" = "ScalableOpenApiPetstoreExample"
            }
          + name             = "scalable-openapi-petstore-example"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "2"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "App" = "ScalableOpenApiPetstoreExample"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "App" = "ScalableOpenApiPetstoreExample"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "openapitools/openapi-petstore"
                      + image_pull_policy          = (known after apply)
                      + name                       = "example"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + port {
                          + container_port = 8080
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "0.5"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "250m"
                              + "memory" = "50Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.openapi_petstore will be created
  + resource "kubernetes_service" "openapi_petstore" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "openapi-petstore-example"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "App" = "ScalableOpenApiPetstoreExample"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

  # random_string.suffix will be destroyed
  # (because random_string.suffix is not in configuration)
  - resource "random_string" "suffix" {
      - id          = "cSTm2s3X" -> null
      - length      = 8 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "cSTm2s3X" -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be destroyed
  # (because aws_cloudwatch_log_group.this is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:us-east-2:502648746362:log-group:/aws/eks/education-eks-cSTm2s3X/cluster" -> null
      - id                = "/aws/eks/education-eks-cSTm2s3X/cluster" -> null
      - name              = "/aws/eks/education-eks-cSTm2s3X/cluster" -> null
      - retention_in_days = 90 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.eks.aws_eks_cluster.this[0] will be destroyed
  # (because aws_eks_cluster.this is not in configuration)
  - resource "aws_eks_cluster" "this" {
      - arn                       = "arn:aws:eks:us-east-2:502648746362:cluster/education-eks-cSTm2s3X" -> null
      - certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1URXdNVEF5TURZME0xb1hEVE15TVRBeU9UQXlNRFkwTTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBUHpHCk9EL0lrQXFVQmRnbTV2aEpITmNRYnU2czJoTmxrTVBuRWFBbDJtdUJFQ01FQ0Z3RWFITmJPVTZkVUV5bEQzMnQKaWh0WVJ0WktmMlB6MDNMQllIdjUyUm8wTmVkUGdrSXVPQnhrbmFlcjVHNkEvRFUzWVVtR1dBQUwvSTZTTVdrcApSV3gzMnkrNmdHcWZKYllnRmNvR2c3WStMSHpqUlRtSng4ZFdPam40QjkyeDFXUys5akF0Y0swVlNNR1VXRmZXCnhhd1BhUEZ3OThWajRhanFqSTkxTFB3bXFnUFd1VTlzWmFSSXlldWkvWHh6eTNwTDRyZ1NuaGpUa1dzZFF4S28KeTV5Zmx2OURqdHpOMkFMWnlmOEhMV1lpZlgrYTNiYXh4dC8zb0ZPcWRtZUNDNnRkMTU2cVQwTG5waitmUVJtWApxYVA0NEo1QnFTLzM0aFpJcm1VQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZJQ0E3akJtUVNiZzVveURPUXVwQVhlMkE3UUFNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBQ2xmc0Zkd2lwY20zZUxsM3JLbgo0NU9xUUZFMk5ucmc2ZXFRemNjb3Jkb3NhWmpvU2tNQUZCcXF5VFJJelFtWUlPM0JyVSt6ejN3dkxLMGZIblU5CkloeVVuYnBNdEpIN2tlZXBVYXcrSmlXWE0vZlJvTHRZT29HbjNGaFFuaEJLT2prU2hMWjZoRTBBQnZsV21lc0EKNnhYaldjeXUzbUxFMDhCL00wMlVLTHRZWXpWK2R5NDFkblZ5TFIxWWJVZlNGL0lUa1o0L0xXa2wrMGJ4cmdCeQpOWlR6SlZXTG5iamVFSjVOWGJCcXJ2MDl3U3RWdGswZitKT3hseEpUTmg0blgyWko3UVhOY3RlU2liUGtoWTlTCmJBT0oxd0NNb2VkbG4wR2U4RXRFT0VydmNwd3BVUVpxQjh3NUVGbHBYSmI3R1hCWlpkRXBkQVhKdGQ0VUlXSzIKS3g0PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> null
      - created_at                = "2022-11-01 02:01:18.761 +0000 UTC" -> null
      - enabled_cluster_log_types = [
          - "api",
          - "audit",
          - "authenticator",
        ] -> null
      - endpoint                  = "https://AAF147321E0BA8177AD1C370F55A3DBA.gr7.us-east-2.eks.amazonaws.com" -> null
      - id                        = "education-eks-cSTm2s3X" -> null
      - identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-2.amazonaws.com/id/AAF147321E0BA8177AD1C370F55A3DBA"
                    },
                ]
            },
        ] -> null
      - name                      = "education-eks-cSTm2s3X" -> null
      - platform_version          = "eks.6" -> null
      - role_arn                  = "arn:aws:iam::502648746362:role/education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - version                   = "1.22" -> null

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      - timeouts {}

      - vpc_config {
          - cluster_security_group_id = "sg-0a607d44417f1844f" -> null
          - endpoint_private_access   = false -> null
          - endpoint_public_access    = true -> null
          - public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> null
          - security_group_ids        = [
              - "sg-0b76c04e2167e6329",
            ] -> null
          - subnet_ids                = [
              - "subnet-01bad3e8ad4f127d9",
              - "subnet-0926af082fb2873d1",
              - "subnet-0f88d0dc8f9d336d5",
            ] -> null
          - vpc_id                    = "vpc-06dd6077940bd8e21" -> null
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be destroyed
  # (because aws_iam_openid_connect_provider.oidc_provider is not in configuration)
  - resource "aws_iam_openid_connect_provider" "oidc_provider" {
      - arn             = "arn:aws:iam::502648746362:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/AAF147321E0BA8177AD1C370F55A3DBA" -> null
      - client_id_list  = [
          - "sts.amazonaws.com",
        ] -> null
      - id              = "arn:aws:iam::502648746362:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/AAF147321E0BA8177AD1C370F55A3DBA" -> null
      - tags            = {
          - "Name" = "education-eks-cSTm2s3X-eks-irsa"
        } -> null
      - tags_all        = {
          - "Name" = "education-eks-cSTm2s3X-eks-irsa"
        } -> null
      - thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> null
      - url             = "oidc.eks.us-east-2.amazonaws.com/id/AAF147321E0BA8177AD1C370F55A3DBA" -> null
    }

  # module.eks.aws_iam_role.this[0] will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::502648746362:role/education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                      - Sid       = "EKSClusterAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-01T02:01:11Z" -> null
      - force_detach_policies = true -> null
      - id                    = "education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
      - name_prefix           = "education-eks-cSTm2s3X-cluster-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXKCBTGF5JLG5LK6UY" -> null

      - inline_policy {
          - name   = "education-eks-cSTm2s3X-cluster" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Deny"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "education-eks-cSTm2s3X-cluster-20221101020111561200000001-20221101020112396500000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "education-eks-cSTm2s3X-cluster-20221101020111561200000001-20221101020112397300000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController" -> null
      - role       = "education-eks-cSTm2s3X-cluster-20221101020111561200000001" -> null
    }

  # module.eks.aws_security_group.cluster[0] will be destroyed
  # (because aws_security_group.cluster is not in configuration)
  - resource "aws_security_group" "cluster" {
      - arn                    = "arn:aws:ec2:us-east-2:502648746362:security-group/sg-0b76c04e2167e6329" -> null
      - description            = "EKS cluster security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f0ea443d8e4e7385",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f0ea443d8e4e7385",
                ]
              - self             = false
              - to_port          = 10250
            },
        ] -> null
      - id                     = "sg-0b76c04e2167e6329" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f0ea443d8e4e7385",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "education-eks-cSTm2s3X-cluster-20221101020111574400000002" -> null
      - name_prefix            = "education-eks-cSTm2s3X-cluster-" -> null
      - owner_id               = "502648746362" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "education-eks-cSTm2s3X-cluster"
        } -> null
      - tags_all               = {
          - "Name" = "education-eks-cSTm2s3X-cluster"
        } -> null
      - vpc_id                 = "vpc-06dd6077940bd8e21" -> null
    }

  # module.eks.aws_security_group.node[0] will be destroyed
  # (because aws_security_group.node is not in configuration)
  - resource "aws_security_group" "node" {
      - arn                    = "arn:aws:ec2:us-east-2:502648746362:security-group/sg-0f0ea443d8e4e7385" -> null
      - description            = "EKS node shared security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/TCP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/UDP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress all HTTPS to internet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Node groups to cluster API"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0b76c04e2167e6329",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> null
      - id                     = "sg-0f0ea443d8e4e7385" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node groups"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0b76c04e2167e6329",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Cluster API to node kubelets"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0b76c04e2167e6329",
                ]
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> null
      - name                   = "education-eks-cSTm2s3X-node-20221101020111582600000005" -> null
      - name_prefix            = "education-eks-cSTm2s3X-node-" -> null
      - owner_id               = "502648746362" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "education-eks-cSTm2s3X-node"
        } -> null
      - tags_all               = {
          - "Name" = "education-eks-cSTm2s3X-node"
        } -> null
      - vpc_id                 = "vpc-06dd6077940bd8e21" -> null
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be destroyed
  # (because aws_security_group_rule.cluster is not in configuration)
  - resource "aws_security_group_rule" "cluster" {
      - description              = "Cluster API to node groups" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-501278056" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0b76c04e2167e6329" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - to_port                  = 443 -> null
      - type                     = "egress" -> null
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be destroyed
  # (because aws_security_group_rule.cluster is not in configuration)
  - resource "aws_security_group_rule" "cluster" {
      - description              = "Cluster API to node kubelets" -> null
      - from_port                = 10250 -> null
      - id                       = "sgrule-3556363000" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0b76c04e2167e6329" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - to_port                  = 10250 -> null
      - type                     = "egress" -> null
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be destroyed
  # (because aws_security_group_rule.cluster is not in configuration)
  - resource "aws_security_group_rule" "cluster" {
      - description              = "Node groups to cluster API" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1353730512" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0b76c04e2167e6329" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description              = "Node groups to cluster API" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-230865357" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0f0ea443d8e4e7385" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0b76c04e2167e6329" -> null
      - to_port                  = 443 -> null
      - type                     = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress all HTTPS to internet" -> null
      - from_port         = 443 -> null
      - id                = "sgrule-3966656301" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress NTP/TCP to internet" -> null
      - from_port         = 123 -> null
      - id                = "sgrule-867197491" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = false -> null
      - to_port           = 123 -> null
      - type              = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress NTP/UDP to internet" -> null
      - from_port         = 123 -> null
      - id                = "sgrule-1294878526" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "udp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = false -> null
      - to_port           = 123 -> null
      - type              = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description       = "Node to node CoreDNS" -> null
      - from_port         = 53 -> null
      - id                = "sgrule-2957666577" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = true -> null
      - to_port           = 53 -> null
      - type              = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description       = "Node to node CoreDNS" -> null
      - from_port         = 53 -> null
      - id                = "sgrule-1043196791" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "udp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = true -> null
      - to_port           = 53 -> null
      - type              = "egress" -> null
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description              = "Cluster API to node groups" -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-2325922403" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0f0ea443d8e4e7385" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0b76c04e2167e6329" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description              = "Cluster API to node kubelets" -> null
      - from_port                = 10250 -> null
      - id                       = "sgrule-588939209" -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0f0ea443d8e4e7385" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-0b76c04e2167e6329" -> null
      - to_port                  = 10250 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description       = "Node to node CoreDNS" -> null
      - from_port         = 53 -> null
      - id                = "sgrule-2042899140" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = true -> null
      - to_port           = 53 -> null
      - type              = "ingress" -> null
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be destroyed
  # (because aws_security_group_rule.node is not in configuration)
  - resource "aws_security_group_rule" "node" {
      - description       = "Node to node CoreDNS" -> null
      - from_port         = 53 -> null
      - id                = "sgrule-3717957931" -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "udp" -> null
      - security_group_id = "sg-0f0ea443d8e4e7385" -> null
      - self              = true -> null
      - to_port           = 53 -> null
      - type              = "ingress" -> null
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0fe6eb76dbfcf6788" -> null
      - association_id       = "eipassoc-0776bdc92c11fff1c" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0fe6eb76dbfcf6788" -> null
      - network_border_group = "us-east-2" -> null
      - network_interface    = "eni-0a781069b2142bd5a" -> null
      - private_dns          = "ip-10-0-4-209.us-east-2.compute.internal" -> null
      - private_ip           = "10.0.4.209" -> null
      - public_dns           = "ec2-18-118-64-215.us-east-2.compute.amazonaws.com" -> null
      - public_ip            = "18.118.64.215" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Name" = "education-vpc-us-east-2a"
        } -> null
      - tags_all             = {
          - "Name" = "education-vpc-us-east-2a"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] will be destroyed
  # (because aws_internet_gateway.this is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-2:502648746362:internet-gateway/igw-0a77f6d8f64eebccf" -> null
      - id       = "igw-0a77f6d8f64eebccf" -> null
      - owner_id = "502648746362" -> null
      - tags     = {
          - "Name" = "education-vpc"
        } -> null
      - tags_all = {
          - "Name" = "education-vpc"
        } -> null
      - vpc_id   = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  # (because aws_nat_gateway.this is not in configuration)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0fe6eb76dbfcf6788" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0e60bc5b5a31b3181" -> null
      - network_interface_id = "eni-0a781069b2142bd5a" -> null
      - private_ip           = "10.0.4.209" -> null
      - public_ip            = "18.118.64.215" -> null
      - subnet_id            = "subnet-0204c92f83adb71a1" -> null
      - tags                 = {
          - "Name" = "education-vpc-us-east-2a"
        } -> null
      - tags_all             = {
          - "Name" = "education-vpc-us-east-2a"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be destroyed
  # (because aws_route.private_nat_gateway is not in configuration)
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0d2ebfda94a0f2cc11080289494" -> null
      - nat_gateway_id         = "nat-0e60bc5b5a31b3181" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0d2ebfda94a0f2cc1" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be destroyed
  # (because aws_route.public_internet_gateway is not in configuration)
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0a77f6d8f64eebccf" -> null
      - id                     = "r-rtb-0b5b4e05f0425b5fe1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0b5b4e05f0425b5fe" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:502648746362:route-table/rtb-0d2ebfda94a0f2cc1" -> null
      - id               = "rtb-0d2ebfda94a0f2cc1" -> null
      - owner_id         = "502648746362" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0e60bc5b5a31b3181"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "education-vpc-private"
        } -> null
      - tags_all         = {
          - "Name" = "education-vpc-private"
        } -> null
      - vpc_id           = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_route_table.public[0] will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-2:502648746362:route-table/rtb-0b5b4e05f0425b5fe" -> null
      - id               = "rtb-0b5b4e05f0425b5fe" -> null
      - owner_id         = "502648746362" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0a77f6d8f64eebccf"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "education-vpc-public"
        } -> null
      - tags_all         = {
          - "Name" = "education-vpc-public"
        } -> null
      - vpc_id           = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_route_table_association.private[0] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-06bdb13d11914762e" -> null
      - route_table_id = "rtb-0d2ebfda94a0f2cc1" -> null
      - subnet_id      = "subnet-0926af082fb2873d1" -> null
    }

  # module.vpc.aws_route_table_association.private[1] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-09f06054afd4a7ddf" -> null
      - route_table_id = "rtb-0d2ebfda94a0f2cc1" -> null
      - subnet_id      = "subnet-01bad3e8ad4f127d9" -> null
    }

  # module.vpc.aws_route_table_association.private[2] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0c6772c650ed71e6e" -> null
      - route_table_id = "rtb-0d2ebfda94a0f2cc1" -> null
      - subnet_id      = "subnet-0f88d0dc8f9d336d5" -> null
    }

  # module.vpc.aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-06f890f07828d21f0" -> null
      - route_table_id = "rtb-0b5b4e05f0425b5fe" -> null
      - subnet_id      = "subnet-0204c92f83adb71a1" -> null
    }

  # module.vpc.aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-00ed9d3858799ce6f" -> null
      - route_table_id = "rtb-0b5b4e05f0425b5fe" -> null
      - subnet_id      = "subnet-0464fcd7f70fb881e" -> null
    }

  # module.vpc.aws_route_table_association.public[2] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-056e9cef5f0707096" -> null
      - route_table_id = "rtb-0b5b4e05f0425b5fe" -> null
      - subnet_id      = "subnet-0cc61a88089e29664" -> null
    }

  # module.vpc.aws_subnet.private[0] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-0926af082fb2873d1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2a" -> null
      - availability_zone_id                           = "use2-az1" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0926af082fb2873d1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-private-us-east-2a"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-private-us-east-2a"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_subnet.private[1] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-01bad3e8ad4f127d9" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01bad3e8ad4f127d9" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-private-us-east-2b"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-private-us-east-2b"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_subnet.private[2] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-0f88d0dc8f9d336d5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2c" -> null
      - availability_zone_id                           = "use2-az3" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f88d0dc8f9d336d5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-private-us-east-2c"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-private-us-east-2c"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/internal-elb"              = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-0204c92f83adb71a1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2a" -> null
      - availability_zone_id                           = "use2-az1" -> null
      - cidr_block                                     = "10.0.4.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0204c92f83adb71a1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-public-us-east-2a"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-public-us-east-2a"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-0464fcd7f70fb881e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.0.5.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0464fcd7f70fb881e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-public-us-east-2b"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-public-us-east-2b"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_subnet.public[2] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:502648746362:subnet/subnet-0cc61a88089e29664" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2c" -> null
      - availability_zone_id                           = "use2-az3" -> null
      - cidr_block                                     = "10.0.6.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0cc61a88089e29664" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "502648746362" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"                                         = "education-vpc-public-us-east-2c"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - tags_all                                       = {
          - "Name"                                         = "education-vpc-public-us-east-2c"
          - "kubernetes.io/cluster/education-eks-cSTm2s3X" = "shared"
          - "kubernetes.io/role/elb"                       = "1"
        } -> null
      - vpc_id                                         = "vpc-06dd6077940bd8e21" -> null
    }

  # module.vpc.aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-2:502648746362:vpc/vpc-06dd6077940bd8e21" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0a27cabf56ef53dad" -> null
      - default_route_table_id               = "rtb-08ec680dd49c43f4a" -> null
      - default_security_group_id            = "sg-0a5d568c4de34af1f" -> null
      - dhcp_options_id                      = "dopt-0e805c65" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-06dd6077940bd8e21" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-08ec680dd49c43f4a" -> null
      - owner_id                             = "502648746362" -> null
      - tags                                 = {
          - "Name" = "education-vpc"
        } -> null
      - tags_all                             = {
          - "Name" = "education-vpc"
        } -> null
    }

  # module.eks.module.eks_managed_node_group["one"].aws_eks_node_group.this[0] will be destroyed
  # (because aws_eks_node_group.this is not in configuration)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2_x86_64" -> null
      - arn                    = "arn:aws:eks:us-east-2:502648746362:nodegroup/education-eks-cSTm2s3X/node-group-1-20221101021007836600000014/04c21879-ffc9-673c-3945-317b642625f4" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "education-eks-cSTm2s3X" -> null
      - disk_size              = 0 -> null
      - id                     = "education-eks-cSTm2s3X:node-group-1-20221101021007836600000014" -> null
      - instance_types         = [
          - "t3.small",
        ] -> null
      - labels                 = {} -> null
      - node_group_name        = "node-group-1-20221101021007836600000014" -> null
      - node_group_name_prefix = "node-group-1-" -> null
      - node_role_arn          = "arn:aws:iam::502648746362:role/node-group-1-eks-node-group-20221101020113350400000009" -> null
      - release_version        = "1.22.12-20220926" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-node-group-1-20221101021007836600000014-04c21879-ffc9-673c-3945-317b642625f4"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-01bad3e8ad4f127d9",
          - "subnet-0926af082fb2873d1",
          - "subnet-0f88d0dc8f9d336d5",
        ] -> null
      - tags                   = {
          - "Name" = "node-group-1"
        } -> null
      - tags_all               = {
          - "Name" = "node-group-1"
        } -> null
      - version                = "1.22" -> null

      - launch_template {
          - id      = "lt-0b315abcd941a05e6" -> null
          - name    = "one-20221101021007561900000010" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 2 -> null
          - max_size     = 3 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role.this[0] will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::502648746362:role/node-group-1-eks-node-group-20221101020113350400000009" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSNodeAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-01T02:01:13Z" -> null
      - description           = "EKS managed node group IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "node-group-1-eks-node-group-20221101020113350400000009" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "node-group-1-eks-node-group-20221101020113350400000009" -> null
      - name_prefix           = "node-group-1-eks-node-group-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXKCBTGF5CCMAZ4TZJ" -> null

      - inline_policy {}
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-1-eks-node-group-20221101020113350400000009-2022110102011526530000000e" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "node-group-1-eks-node-group-20221101020113350400000009" -> null
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-1-eks-node-group-20221101020113350400000009-2022110102011513360000000d" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "node-group-1-eks-node-group-20221101020113350400000009" -> null
    }

  # module.eks.module.eks_managed_node_group["one"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-1-eks-node-group-20221101020113350400000009-2022110102011530960000000f" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "node-group-1-eks-node-group-20221101020113350400000009" -> null
    }

  # module.eks.module.eks_managed_node_group["one"].aws_launch_template.this[0] will be destroyed
  # (because aws_launch_template.this is not in configuration)
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-east-2:502648746362:launch-template/lt-0b315abcd941a05e6" -> null
      - default_version         = 1 -> null
      - description             = "Custom launch template for node-group-1 EKS managed node group" -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-0b315abcd941a05e6" -> null
      - latest_version          = 1 -> null
      - name                    = "one-20221101021007561900000010" -> null
      - name_prefix             = "one-" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - update_default_version  = true -> null
      - user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSIvLyIKTUlNRS1WZXJzaW9uOiAxLjANCg0KLS0vLw0KQ29udGVudC1UcmFuc2Zlci1FbmNvZGluZzogN2JpdA0KQ29udGVudC1UeXBlOiB0ZXh0L3gtc2hlbGxzY3JpcHQNCk1pbWUtVmVyc2lvbjogMS4wDQoNCmVjaG8gJ2ZvbyBiYXInCg0KLS0vLy0tDQo=" -> null
      - vpc_security_group_ids  = [
          - "sg-0708ad38f4d693d96",
          - "sg-0a607d44417f1844f",
          - "sg-0f0ea443d8e4e7385",
        ] -> null

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - monitoring {
          - enabled = true -> null
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name" = "node-group-1"
            } -> null
        }
      - tag_specifications {
          - resource_type = "network-interface" -> null
          - tags          = {
              - "Name" = "node-group-1"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Name" = "node-group-1"
            } -> null
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_eks_node_group.this[0] will be destroyed
  # (because aws_eks_node_group.this is not in configuration)
  - resource "aws_eks_node_group" "this" {
      - ami_type               = "AL2_x86_64" -> null
      - arn                    = "arn:aws:eks:us-east-2:502648746362:nodegroup/education-eks-cSTm2s3X/node-group-2-20221101021007837200000016/f8c21879-ffc5-9c2b-3a84-19ec11ea8035" -> null
      - capacity_type          = "ON_DEMAND" -> null
      - cluster_name           = "education-eks-cSTm2s3X" -> null
      - disk_size              = 0 -> null
      - id                     = "education-eks-cSTm2s3X:node-group-2-20221101021007837200000016" -> null
      - instance_types         = [
          - "t3.medium",
        ] -> null
      - labels                 = {} -> null
      - node_group_name        = "node-group-2-20221101021007837200000016" -> null
      - node_group_name_prefix = "node-group-2-" -> null
      - node_role_arn          = "arn:aws:iam::502648746362:role/node-group-2-eks-node-group-20221101020113350200000008" -> null
      - release_version        = "1.22.12-20220926" -> null
      - resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-node-group-2-20221101021007837200000016-f8c21879-ffc5-9c2b-3a84-19ec11ea8035"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-01bad3e8ad4f127d9",
          - "subnet-0926af082fb2873d1",
          - "subnet-0f88d0dc8f9d336d5",
        ] -> null
      - tags                   = {
          - "Name" = "node-group-2"
        } -> null
      - tags_all               = {
          - "Name" = "node-group-2"
        } -> null
      - version                = "1.22" -> null

      - launch_template {
          - id      = "lt-01bfff9762c543e29" -> null
          - name    = "two-20221101021007563500000012" -> null
          - version = "1" -> null
        }

      - scaling_config {
          - desired_size = 1 -> null
          - max_size     = 2 -> null
          - min_size     = 1 -> null
        }

      - timeouts {}

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role.this[0] will be destroyed
  # (because aws_iam_role.this is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::502648746362:role/node-group-2-eks-node-group-20221101020113350200000008" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSNodeAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-01T02:01:13Z" -> null
      - description           = "EKS managed node group IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "node-group-2-eks-node-group-20221101020113350200000008" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "node-group-2-eks-node-group-20221101020113350200000008" -> null
      - name_prefix           = "node-group-2-eks-node-group-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXKCBTGF5PE2BU7GK2" -> null

      - inline_policy {}
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-2-eks-node-group-20221101020113350200000008-2022110102011481840000000a" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "node-group-2-eks-node-group-20221101020113350200000008" -> null
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-2-eks-node-group-20221101020113350200000008-2022110102011502930000000c" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "node-group-2-eks-node-group-20221101020113350200000008" -> null
    }

  # module.eks.module.eks_managed_node_group["two"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because aws_iam_role_policy_attachment.this is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "node-group-2-eks-node-group-20221101020113350200000008-2022110102011492380000000b" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "node-group-2-eks-node-group-20221101020113350200000008" -> null
    }

  # module.eks.module.eks_managed_node_group["two"].aws_launch_template.this[0] will be destroyed
  # (because aws_launch_template.this is not in configuration)
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-east-2:502648746362:launch-template/lt-01bfff9762c543e29" -> null
      - default_version         = 1 -> null
      - description             = "Custom launch template for node-group-2 EKS managed node group" -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-01bfff9762c543e29" -> null
      - latest_version          = 1 -> null
      - name                    = "two-20221101021007563500000012" -> null
      - name_prefix             = "two-" -> null
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - update_default_version  = true -> null
      - user_data               = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSIvLyIKTUlNRS1WZXJzaW9uOiAxLjANCg0KLS0vLw0KQ29udGVudC1UcmFuc2Zlci1FbmNvZGluZzogN2JpdA0KQ29udGVudC1UeXBlOiB0ZXh0L3gtc2hlbGxzY3JpcHQNCk1pbWUtVmVyc2lvbjogMS4wDQoNCmVjaG8gJ2ZvbyBiYXInCg0KLS0vLy0tDQo=" -> null
      - vpc_security_group_ids  = [
          - "sg-0a607d44417f1844f",
          - "sg-0e50ead75caa19255",
          - "sg-0f0ea443d8e4e7385",
        ] -> null

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - monitoring {
          - enabled = true -> null
        }

      - tag_specifications {
          - resource_type = "instance" -> null
          - tags          = {
              - "Name" = "node-group-2"
            } -> null
        }
      - tag_specifications {
          - resource_type = "network-interface" -> null
          - tags          = {
              - "Name" = "node-group-2"
            } -> null
        }
      - tag_specifications {
          - resource_type = "volume" -> null
          - tags          = {
              - "Name" = "node-group-2"
            } -> null
        }
    }

Plan: 2 to add, 0 to change, 56 to destroy.

Changes to Outputs:
  - cluster_endpoint          = "https://AAF147321E0BA8177AD1C370F55A3DBA.gr7.us-east-2.eks.amazonaws.com" -> null
  - cluster_id                = "education-eks-cSTm2s3X" -> null
  - cluster_name              = "education-eks-cSTm2s3X" -> null
  - cluster_security_group_id = "sg-0b76c04e2167e6329" -> null
  + lb_ip                     = (known after apply)
  - region                    = "us-east-2" -> null

```

</details>

*Pushed by: @joshuayeung, Action: `pull_request`*